### Practice_Part_01: Data Structures

In [148]:
import pandas as pd
import numpy as np

#### Exercise_01
_1. Create a Series object using numpy linspace and random.randn functions_

In [149]:
# numpy linspace function
ser_linspace = pd.Series(np.linspace(0, 10, num= 10))
ser_linspace

0     0.000000
1     1.111111
2     2.222222
3     3.333333
4     4.444444
5     5.555556
6     6.666667
7     7.777778
8     8.888889
9    10.000000
dtype: float64

In [150]:
# numpy random.randn function
ser_randm = pd.Series(np.random.randn(5))
ser_randm

0    0.718989
1    0.204468
2   -1.113478
3   -1.763808
4   -0.146606
dtype: float64

#### Exercise_02
_1. Create a Series using a list of elements_

In [151]:
# series using a list of integers and floating point numbers
list = [1, 3.0, 3.4, 2, 10.8]
ser_list = pd.Series(list, index= ['a', 'b', 'c', 'd', 'e'])
ser_list

a     1.0
b     3.0
c     3.4
d     2.0
e    10.8
dtype: float64

In [152]:
# series using a list of string values
str_list = ['Peter', 'Glenn', 'Joe', 'cleveland']
series_str = pd.Series(str_list)
series_str

0        Peter
1        Glenn
2          Joe
3    cleveland
dtype: object

#### Exercise_03
_1. For the data given below, get the index and values after forming a Series object_

In [153]:
Data = {'India': 'New Delhi', 'Japan': 'Tokyo', 'UK': 'London'}
ser_data = pd.Series(Data)
ser_data

India    New Delhi
Japan        Tokyo
UK          London
dtype: object

In [154]:
# indexes & values
ind = ser_data.index
values = ser_data.values

print('Indexes:', ind)
print('Values:', values)

Indexes: Index(['India', 'Japan', 'UK'], dtype='object')
Values: ['New Delhi' 'Tokyo' 'London']

#### Exercise_04
_Create a Series using a range of 10 values and specify the index explicitly. Use capital letters to index explicitly_

In [155]:
ser = pd.Series(range(1, 11), index= ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'K'])
ser

A     1
B     2
C     3
D     4
E     5
F     6
G     7
H     8
I     9
K    10
dtype: int64

#### Exercise_05
_Find the shape and size for the series created in exercise_04_

In [156]:
size = ser.size
shape = ser.shape

print('Size:', size)
print('Shape:', shape)

Size: 10
Shape: (10,)

#### Exercise_06
_Slice the values of the Series created in exercise_04_
- _(a) Slice from 4th index up to the end with step size 3_
- _(b) Slice the entire series in reverse order_
- _(c) Slice the entire series with step size 2_

In [157]:
# Slice from 4th index up to the end with step size 3
ser.iloc[4::3]

E    5
H    8
dtype: int64

In [201]:
# Slice the entire series in reverse order
ser.iloc[::-1]

K    10
I     9
H     8
G     7
F     6
E     5
D     4
C     3
B     2
A     1
dtype: int64

In [159]:
# Slice the entire series with step size 2
ser.iloc[::2]

A    1
C    3
E    5
G    7
I    9
dtype: int64

#### Exercise_07
_Convert the Series object values created for exercise_04 back into the list of values_

In [204]:
# check the data type first before converting
print(type(ser.values))

# convert
list = ser.values.tolist()
print(list)
print(type(list))

<class 'numpy.ndarray'>
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
<class 'list'>

#### Exercise_08
_For the data given below, construct a series and add data = [500, 600, 700] to the existing series_
- _data= ['25', '50', '100', '200', '300', '400']_

In [205]:
data= ['25', '50', '100', '200', '300', '400']
data_series = pd.Series(data, index= [0, 1, 2, 3, 4, 5])

new_data = ['500', '600', '700']
new_data_series = pd.Series(new_data, index= [6, 7, 8])

updated_series = pd.concat([data_series, new_data_series])
print(updated_series)

0     25
1     50
2    100
3    200
4    300
5    400
6    500
7    600
8    700
dtype: object

#### Exercise_09
_For the series created in exercise_08, get the subset of the series for the condition given below_
- _*Condition*: Values greater than or equal to 100_

In [ ]:
# Convert the string values into numeric type
numeric_data = pd.to_numeric(updated_series)

# filter
condition = (numeric_data >= 100)

# apply the filter
sub_series = numeric_data[condition]
print(sub_series)

2    100
3    200
4    300
5    400
6    500
7    600
8    700
dtype: int64

#### Exercise_10
_For the data given below, construct a pandas DataFrame object. Use labels data to set as the index of the dataframe. After creating the DataFrame, display a summary of the basic information._

In [163]:
example_data = {
    'name': ['Arun', 'Rama', 'Kantharaj', 'James', 'Quagmire', 'George', 'Emily', 'Michael', 'Griffin', 'Stewie'],
    'score': [12, 10, 17, np.nan, 9, 30, 15, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(example_data, index=labels)
df

        name  score  attempts qualify
a       Arun   12.0         1     yes
b       Rama   10.0         3      no
c  Kantharaj   17.0         2     yes
d      James    NaN         3      no
e   Quagmire    9.0         2      no
f     George   30.0         3     yes
g      Emily   15.0         1     yes
h    Michael    NaN         1      no
i    Griffin    8.0         2      no
j     Stewie   19.0         1     yes

In [164]:
# summary
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

#### Exercise_11
1. _Find the names of people who have scores greater than 12 for the data created in exercise_10_
2. _Separate people with and without scores for the data created in exercise_10_

In [222]:
# people with scores > 12
cond = (df['score'] > 12)
names = df.loc[cond, 'name'].to_list()
names

['Kantharaj', 'George', 'Emily', 'Stewie']

In [166]:
# people with and without any scores

# with scores
people_with_scores = df.loc[df['score'].notna(), 'name'].to_list()
print('People with scores:', people_with_scores)

# without scores
people_without_scores = df.loc[df['score'].isna(), 'name'].to_list()
print('People without scores:', people_without_scores)

People with scores: ['Arun', 'Rama', 'Kantharaj', 'Quagmire', 'George', 'Emily', 'Griffin', 'Stewie']
People without scores: ['James', 'Michael']

#### Exercise_12
_Find the participants who qualify the test and who didn't qualify the test for the data created in exercise_10_

In [167]:
# Qualified
Qualified = df.loc[df['qualify'] == 'yes', 'name'].to_list()
print('Qualified:', Qualified)

# Not Qualified
Not_Qualified = df.loc[df['qualify']== 'no', 'name'].to_list()
print('Not_Qualified:', Not_Qualified)

Qualified: ['Arun', 'Kantharaj', 'George', 'Emily', 'Stewie']
Not_Qualified: ['Rama', 'James', 'Quagmire', 'Michael', 'Griffin']

#### Exercise_13
_For the data created in exercise_10, separate the columns without score and form a separate dataframe_

In [224]:
list_columns = ['name', 'attempts', 'qualify']
df2 = df[list_columns]
df2

        name  attempts qualify
a       Arun         1     yes
b       Rama         3      no
c  Kantharaj         2     yes
d      James         3      no
e   Quagmire         2      no
f     George         3     yes
g      Emily         1     yes
h    Michael         1      no
i    Griffin         2      no
j     Stewie         1     yes

#### Exercise_14
_For the data created in exercise_10, find the number of participants who have only attempt_

In [225]:
single_attempt_condition = (df['attempts'] == 1)
count = single_attempt_condition.sum()
print('No.of people with 1 attempt:', count)

No.of people with 1 attempt: 4

#### Exercise_15
_For the data created in exercise_10, separate the column 'score' and find the top score_

In [200]:
score = df['score']
top_score = score.max()
print('Top score:', top_score)

Top score: 30.0